nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso804/demo_apps/led_blinky/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PIO0_13 (number 4), S1/CN8[4]/CN6[4]/D2/M_PIO0_13/PIO0_13
  @{ */
#define BOARD_LED_RED_PERIPHERAL GPIO                               /*!<@brief Device name: GPIO */
#define BOARD_LED_RED_SIGNAL PIO0                                   /*!<@brief GPIO signal: PIO0 */
#define BOARD_LED_RED_GPIO GPIO                                     /*!<@brief GPIO device name: GPIO */
#define BOARD_LED_RED_GPIO_PIN 13U                                  /*!<@brief PIO0 pin index: 13 */
#define BOARD_LED_RED_PORT 0U                                       /*!<@brief PORT device name: 0U */
#define BOARD_LED_RED_PIN 13U                                       /*!<@brief 0U pin index: 13 */
#define BOARD_LED_RED_CHANNEL 13                                    /*!<@brief GPIO PIO0 channel: 13 */
#define BOARD_LED_RED_PIN_NAME PIO0_13                              /*!<@brief Pin name */
#define BOARD_LED_RED_LABEL "S1/CN8[4]/CN6[4]/D2/M_PIO0_13/PIO0_13" /*!<@brief Label */
#define BOARD_LED_RED_NAME "LED_RED"                                /*!<@brief Identifier name */
#define BOARD_LED_RED_DIRECTION kPIN_MUX_DirectionOutput            /*!<@brief Direction */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
